In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

from matplotlib import pyplot as plt
%matplotlib inline 
from statsmodels.tsa.seasonal import seasonal_decompose

In [2]:
import os
os.chdir('E:\AIMLGLIM\TIME_SERIES_FORECASTING\me')
os.getcwd()

'E:\\AIMLGLIM\\TIME_SERIES_FORECASTING\\week1'

In [3]:
df = pd.read_csv("cars/cars_dataset.csv",parse_dates=True,squeeze=True,index_col=0)

In [6]:
len(df)

1728

In [10]:
df.columns

Index(['maint', 'doors', 'persons', 'lug_boot', 'safety', 'car'], dtype='object')

In [11]:
df.lug_boot.unique()

array(['small', 'med', 'big'], dtype=object)

In [12]:
df = pd.read_csv("liver_dataset.csv")

In [14]:
df.describe().transpose()

          count       mean        std   min   25%   50%   75%    max
mcv       345.0  90.159420   4.448096  65.0  87.0  90.0  93.0  103.0
alkphos   345.0  69.869565  18.347670  23.0  57.0  67.0  80.0  138.0
sgpt      345.0  30.405797  19.512309   4.0  19.0  26.0  34.0  155.0
sgot      345.0  24.643478  10.064494   5.0  19.0  23.0  27.0   82.0
gammagt   345.0  38.284058  39.254616   5.0  15.0  25.0  46.0  297.0
drinks    345.0   3.455072   3.337835   0.0   0.5   3.0   6.0   20.0
selector  345.0   1.579710   0.494322   1.0   1.0   2.0   2.0    2.0

In [15]:
df['mcv'].median()

90.0

In [17]:
df['alkphos'].max()

138

In [19]:
s = 'abc'

In [20]:
abc*2

NameError: name 'abc' is not defined

In [21]:
s = 'Winner: Mumbai Indians'

In [23]:
s[7:]

' Mumbai Indians'

In [25]:
s[-14:]

'Mumbai Indians'

In [26]:
df = pd.read_csv("Titanic+(2).csv")

In [28]:
df.shape

(1313, 7)

In [29]:
df.head()

,Unnamed: 0,Name,PClass,Age,Sex,Survived,SexCode
0,1,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,2,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,3,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,4,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,5,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [35]:
df[df['Sex']=='male'].sum()

Unnamed: 0                                               588823
Name          Allison, Mr Hudson Joshua CreightonAllison, Ma...
PClass        1st1st1st1st1st1st1st1st1st1st1st1st1st1st1st1...
Age                                                     14514.7
Sex           malemalemalemalemalemalemalemalemalemalemalema...
Survived                                                    142
SexCode                                                       0
dtype: object

In [38]:
df['Age'].min()

0.17

In [60]:
frame=df[df['PClass']=='3rd']

In [61]:
frame

,Unnamed: 0,Name,PClass,Age,Sex,Survived,SexCode
602,603,"Abbing, Mr Anthony",3rd,42.0,male,0,0
603,604,"Abbott, Master Eugene Joseph",3rd,13.0,male,0,0
604,605,"Abbott, Mr Rossmore Edward",3rd,16.0,male,0,0
605,606,"Abbott, Mrs Stanton (Rosa)",3rd,35.0,female,1,1
606,607,"Abelseth, Miss Anna Karen",3rd,16.0,female,1,1
...,...,...,...,...,...,...,...
1308,1309,"Zakarian, Mr Artun",3rd,27.0,male,0,0
1309,1310,"Zakarian, Mr Maprieder",3rd,26.0,male,0,0
1310,1311,"Zenni, Mr Philip",3rd,22.0,male,0,0
1311,1312,"Lievens, Mr Rene",3rd,24.0,male,0,0
1312,1313,"Zimmerman, Leo",3rd,29.0,male,0,0

In [63]:
frame[frame['Age']>60]

      Unnamed: 0                 Name PClass   Age     Sex  Survived  SexCode
772          773      Dewan, Mr Frank    3rd  65.0    male         0        0
1264        1265  Turkula, Mrs Hedvig    3rd  63.0  female         1        1

In [62]:
frame[frame['Age']==frame['Age'].max()]

     Unnamed: 0             Name PClass   Age   Sex  Survived  SexCode
772         773  Dewan, Mr Frank    3rd  65.0  male         0        0

In [68]:
import re 
s = 0 
 
pattern = 'there' 
if re.match(pattern, 'there is a cat'): 
    s += 1 
    print("one")
if re.match(pattern, 'What is there?'): 
    s += 2 ;print("two")
if re.search(pattern, 'How many cats are there?'): 
    s += 4 ; print("three")
if re.search(pattern, 'Cats and dogs both are there'): 
    s += 8;print("four")

print (s)

one
three
four
13

In [69]:
sentence = 'Welcome to Great Learning' 

matched = re.match(r'(.*) (.*?) (.*)', sentence) 

print(matched.groups())

('Welcome to', 'Great', 'Learning')

In [70]:
x = 15 

y = 2 

print(x/y)

7.5

In [71]:
x = 7 

y = 3 

x %= y 

y //= x 

x *= 3 

print((x % 3) == 0 and (y % 3) == 0)

True

In [72]:
Student = {'Name': 'Manish', 'Age': 14, 'Class': 'Ninth', 'Marks' : [20,21,22]  }

In [73]:
print(student[‘Name’])

SyntaxError: invalid character in identifier (<ipython-input-73-58db0eac6523>, line 1)

In [74]:
Student['Name']

'Manish'

In [76]:
for i in range(10):  
    if i == 5:   
          break   
    else:   
           print(i)  
print("Here")

SyntaxError: invalid character in identifier (<ipython-input-76-5c3a2f4e88f2>, line 1)

In [77]:
vowels = ['a','e','i','o','u']   
given_character = 'B'   
if given_character.lower() in vowels:

 print("vowel")  
else :   
  print("not a vowel")

SyntaxError: invalid character in identifier (<ipython-input-77-d8e1efc7aaa0>, line 1)